Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/security_and_emergency_services/civil_defence.html.txt.tmx
Source language: en
Languages: ga

source: Civil Defence is a volunteer-based organization with 4,500 members
ga: Is eagras bunaithe ar shaorálaithe le 4,500 ball atá sa Chosaint Shibhialta

source: It supports the front line emergency services as well as assisting local communities
ga: Tacaíonn sé le seirbhísí éigeandála céad líne chomh maith le cúnamh a thabhairt do phobail áitiúla

source: The Civil Defence Branch of the Department of Defence is responsible for the management and development of Civil Defence at national level
ga: Is í Brainse Cosanta Sibhialta na Roinne Cosanta a bhíonn freagrach as bainistiú agus as forbairt na Cosanta Sibhialta ag leibhéal náisiúnta

source: It provides policy direction, centralised training through the Civil Defence College, administrative support and guidance, and centralised procurement of major items
ga: Soláthraíonn sé treoir bheartas, oiliúint lárnaigh trí Choláiste na Cosanta Sibhialta, tacaíocht riaracháin agus treoir, agus soláthar lárnaithe na mórmhíreanna

source: Civil Defence services are delivered through the Civil Defence Officer of the relevant local authority for that area
ga: Seachadtar seirbhísí na Cosanta Sibhialta trí Oifigeach Cosanta Sibhialta an údaráis áitiúil ábhartha i leith an cheantair úd

source: The Civil Defence Officer is responsible for the day-to-day management of Civil Defence matters under the overall direction of the relevant local authority chief executive
ga: Is é an tOifigeach Cosanta Sibhialta a bhíonn freagrach as bainistiú laethúil cúrsaí na Cosanta Sibhialta faoi stiúir fhoriomlán phríomhfheidhmeannach an údaráis áitiúil ábhartha

source: Civil Defence supports the frontline emergency services in dealing with severe weather, flooding, major accidents, fire fighting and searching for missing people
ga: Tacaíonn an Chosaint Shibhialta le seirbhísí éigeandála céad líne chun plé le drochaimsir, tuilte, tionóiscí móra, comhrac dóiteáin agus cuardach i gcomhair daoine ar iarraidh

source: It also supports community events throughout the year
ga: Tacaíonn sí freisin le himeachtaí pobail ó cheann ceann na bliana

source: Information on the services provided by Civil Defence is available at civildefence.ie
ga: Bíonn eolas i leith na seirbhísí a sholáthraíonn an Chosaint Shibhialta ar fáil ag civildefence.ie

source: You can request information on becoming a Civil Defence volunteer, or have a member of Civil Defence contact you, using an online Enrolment Enquiry form
ga: Is féidir leat eolas a iarraidh chun bheith i do shaorálaí Cosanta Sibhialta, nó chun teagmháil a fháil ó bhall den Chosaint Shibhialta, ach leas a bhaint as foirm ar líne um Fhiosrú Rollaithe

source: If an organisation or group wants the assistance of Civil Defence in the running of an event, they should apply to the Civil Defence Officer in their local authority
ga: Má theastaíonn cúnamh na Cosanta Sibhialta ó eagras nó grúpa chun imeacht éigin a reáchtáil, ba chóir dóibh iarratas a dhéanamh chuig Oifigeach Cosanta Sibhialta ina n-údarás áitiúil

source: Volunteers join Civil Defence through the local authority for their area
ga: Glacann saorálaithe ballraíocht den Chosaint Shibhialta tríd údarás áitiúil dá gceantar
